{
  "@odata.type": "#microsoft.graph.deviceManagementIntent",
  "displayName": "ASD Microsoft Defender for Endpoint Security Baseline v24H1",
  "description": "Microsoft Defender for Endpoint Security Baseline (24H1) configured according to ASD Blueprint for Secure Cloud - https://blueprint.asd.gov.au/configuration/intune/endpoint-security/security-baselines/microsoft-defender-for-endpoint-baseline/",
  "templateId": "2209e067-9c8c-462e-9981-5a8c79165dcc",
  "settingsDelta": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
      "valueJson": "\"enableWithUEFILock\"",
      "value": "enableWithUEFILock"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIdleTimeoutForSecurityAssociationInSeconds",
      "valueJson": "300",
      "value": 300
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallPreSharedKeyEncodingMethod",
      "valueJson": "\"utf8\"",
      "value": "utf8"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIPSecExemptionsAllowDHCP",
      "valueJson": "false",
      "value": false
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
      "valueJson": "{\"firewallEnabled\":\"allowed\",\"inboundConnectionsBlocked\":true,\"unicastResponsesToMulticastBroadcastsRequired\":true,\"connectionSecurityRulesFromGroupPolicyNotMerged\":true,\"incomingTrafficBlocked\":true,\"policyRulesFromGroupPolicyNotMerged\":true}",
      "value": [
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "firewallEnabled",
          "value": "allowed"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "inboundConnectionsBlocked",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "unicastResponsesToMulticastBroadcastsRequired",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "connectionSecurityRulesFromGroupPolicyNotMerged",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "incomingTrafficBlocked",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "policyRulesFromGroupPolicyNotMerged",
          "value": "true"
        }
      ]
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
      "valueJson": "{\"firewallEnabled\":\"allowed\",\"inboundConnectionsBlocked\":true,\"unicastResponsesToMulticastBroadcastsRequired\":true,\"connectionSecurityRulesFromGroupPolicyNotMerged\":true,\"incomingTrafficBlocked\":true,\"policyRulesFromGroupPolicyNotMerged\":true}",
      "value": [
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "firewallEnabled",
          "value": "allowed"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "inboundConnectionsBlocked",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "unicastResponsesToMulticastBroadcastsRequired",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "connectionSecurityRulesFromGroupPolicyNotMerged",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "incomingTrafficBlocked",
          "value": "true"
        },
        {
          "@odata.type": "#microsoft.graph.keyValuePair",
          "name": "policyRulesFromGroupPolicyNotMerged",
          "value": "true"
        }
      ]
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderCloudExtendedTimeout",
      "valueJson": "50",
      "value": 50
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
      "valueJson": "\"quick\"",
      "value": "quick"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScheduledScanDay",
      "valueJson": "\"everyday\"",
      "value": "everyday"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
      "valueJson": "\"sendSafeSamplesAutomatically\"",
      "value": "sendSafeSamplesAutomatically"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScanRemovableDrivesDuringFullScan",
      "valueJson": "true",
      "value": true
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPotentiallyUnwantedAppAction",
      "valueJson": "\"block\"",
      "value": "block"
    }
  ]
}
