{
  "name": "ASD Microsoft Defender for Endpoint Security Baseline",
  "description": "ASD Blueprint Defender for Endpoint Security Baseline aligned with Version 24H1 - Settings Catalog format",
  "platforms": "windows10",
  "technologies": "mdm",
  "templateReference": {
    "templateId": "49b8320f-e179-472e-8e2c-2fde00289ca2_1",
    "templateFamily": "baseline",
    "templateDisplayName": "Microsoft Defender for Endpoint Security Baseline",
    "templateDisplayVersion": "Version 24H1"
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
          "children": []
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_global_disablestatefulftp",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_firewall_mdmstore_global_disablestatefulftp_true",
          "children": []
        }
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_global_saidletime",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 300
        }
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_firewall_mdmstore_global_presharedkeyencoding_utf8",
          "children": []
        }
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_false",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
                "choiceSettingValue": {
                  "value": "device_vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_false",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 50
        }
      }
    },
    {
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
          "children": []
        }
      }
    },
    {
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_defender_schedulescanday_0",
          "children": []
        }
      }
    },
    {
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_1",
          "children": []
        }
      }
    },
    {
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
          "children": []
        }
      }
    },
    {
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
          "children": []
        }
      }
    }
  ]
}
