{
  "@odata.type": "#microsoft.graph.intent",
  "displayName": "Security baseline for Microsoft Edge",
  "description": "ASD Blueprint security baseline configuration for Microsoft Edge - Windows 10 and later",
  "templateId": "a239407c-698d-4ef8-b314-e3ae409204b8",
  "settingsDelta": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~Extensions_ExtensionInstallBlocklist",
      "valueJson": "{\"enabled\":true,\"data\":{\"ExtensionInstallBlocklist\":[\"*\"]}}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~HTTPAuthentication_AllowBasicAuthHTTP",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~HTTPAuthentication_AuthSchemes",
      "valueJson": "{\"enabled\":true,\"data\":{\"AuthSchemes\":\"ntlm,negotiate\"}}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~NativeMessaging_NativeMessagingUserLevelHosts",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~PasswordManagerandProtection_PasswordManagerEnabled",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~PrivateNetworkRequestSettings_InsecurePrivateNetworkRequestsAllowed",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~SmartScreenSettings_SmartScreenEnabled",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~SmartScreenSettings_SmartScreenPuaEnabled",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~SmartScreenSettings_PreventSmartScreenPromptOverride",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge~SmartScreenSettings_PreventSmartScreenPromptOverrideForFiles",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_InternetExplorerIntegrationReloadInIEModeAllowed",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_SSLErrorOverrideAllowed",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_BrowserLegacyExtensionPointsBlockingEnabled",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_SitePerProcess",
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_EdgeEnhanceImagesEnabled",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_WebSQLInThirdPartyContextEnabled",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_SSLVersionMin",
      "valueJson": "{\"enabled\":true,\"data\":{\"SSLVersionMin\":\"tls1.2\"}}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_InternetExplorerIntegrationSiteRedirect",
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--microsoft_edge~Policy~microsoft_edge_SharedArrayBufferUnrestrictedAccessAllowed",
      "valueJson": "false"
    }
  ],
  "roleScopeTagIds": [
    "0"
  ]
}
