{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type":  "#microsoft.graph.androidManagedStoreApp",
    "displayName":  "Intune Company Portal",
    "description":  "Get access to your organization’s resources and keep them secure.",
    "publisher":  "Microsoft Corporation",
    "isFeatured":  false,
    "privacyInformationUrl":  null,
    "informationUrl":  "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal\u0026hl=en-AU",
    "owner":  null,
    "developer":  null,
    "notes":  null,
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "appStoreUrl":  "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal\u0026hl=en-AU",
    "largeIcon":  null
}
