{
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "6e60471d-0f81-421b-888f-f10dc90fe9a0",
    "description":  "Default Windows Compliance Policy",
    "displayName":  "BP - Win10 Compliance Policy",
    "version":  5,
    "passwordRequired":  true,
    "passwordBlockSimple":  true,
    "passwordRequiredToUnlockFromIdle":  true,
    "passwordMinutesOfInactivityBeforeLock":  15,
    "passwordExpirationDays":  65535,
    "passwordMinimumLength":  4,
    "passwordMinimumCharacterSetCount":  0,
    "passwordRequiredType":  "deviceDefault",
    "passwordPreviousPasswordBlockCount":  12,
    "requireHealthyDeviceReport":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  true,
    "secureBootEnabled":  true,
    "codeIntegrityEnabled":  true,
    "memoryIntegrityEnabled":  false,
    "kernelDmaProtectionEnabled":  false,
    "virtualizationBasedSecurityEnabled":  false,
    "firmwareProtectionEnabled":  false,
    "storageRequireEncryption":  true,
    "activeFirewallRequired":  true,
    "defenderEnabled":  true,
    "defenderVersion":  null,
    "signatureOutOfDate":  true,
    "rtpEnabled":  true,
    "antivirusRequired":  true,
    "antiSpywareRequired":  true,
    "deviceThreatProtectionEnabled":  true,
    "deviceThreatProtectionRequiredSecurityLevel":  "low",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  true,
    "deviceCompliancePolicyScript":  null,
    "validOperatingSystemBuildRanges":  [],
    "scheduledActionsForRule":  [
                                    {
                                        "scheduledActionConfigurations":  [
                                                                              {
                                                                                  "actionType":  "block"
                                                                              }
                                                                          ],
                                        "ruleName":  null
                                    }
                                ]
}
