{
    "creationSource":  null,
    "description":  "Windows 10, Windows 11 and Windows Server",
    "name":  "Endpoint Detection and Response",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  2,
    "technologies":  "mdm,microsoftSense",
    "id":  "7536aedb-f52b-4a3d-a14f-81d7f43484f4",
    "templateReference":  {
                              "templateId":  "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
                              "templateFamily":  "endpointSecurityEndpointDetectionAndResponse",
                              "templateDisplayName":  "Endpoint detection and response",
                              "templateDisplayVersion":  "Version 1"
                          },
    "settings":  [
                     {
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "6998c81e-2814-4f5e-b492-a6159128a97b"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "f72c326c-7c5b-4224-b890-0b9b54522bd9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     },
                     {
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "03de6095-07c4-4f35-be38-c1cd3bae4484"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_2",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "settingValueTemplateId":  "350b0bea-b67b-43d4-9a04-c796edb961fd",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             }
                     }
                 ]
}
