{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type":  "#microsoft.graph.win32CatalogApp",
    "id":  "c1ef535a-7cf5-44c2-be0d-d129aa9d7fff",
    "displayName":  "Chrome for Business 64-bit",
    "description":  "Google Chrome is a cross-platform web browser developed by Google. It was first released in 2008 for Microsoft Windows, and was later ported to Linux, macOS, iOS, and Android where it is the default browser built into the OS.",
    "publisher":  "Google",
    "largeIcon":  null,
    "isFeatured":  false,
    "privacyInformationUrl":  "",
    "informationUrl":  null,
    "owner":  "",
    "developer":  "",
    "notes":  "",
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "committedContentVersion":  "1",
    "fileName":  "googlechromestandaloneenterprise64.msi",
    "size":  116297008,
    "installCommandLine":  "\"%SystemRoot%\\System32\\msiexec.exe\" /i \"googlechromestandaloneenterprise64.msi\" /qn",
    "uninstallCommandLine":  "\"%SystemRoot%\\System32\\msiexec.exe\" /X {2973D1E7-DE82-3E05-9DBD-245F3B51E8A8} /qn",
    "applicableArchitectures":  "x64",
    "minimumFreeDiskSpaceInMB":  null,
    "minimumMemoryInMB":  null,
    "minimumNumberOfProcessors":  null,
    "minimumCpuSpeedInMHz":  null,
    "setupFilePath":  "googlechromestandaloneenterprise64.msi",
    "minimumSupportedWindowsRelease":  "1607",
    "displayVersion":  "121.0.6167.185",
    "allowAvailableUninstall":  true,
    "mobileAppCatalogPackageId":  "b58aebf9-8bde-bac8-537f-a560a3afff70",
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  false,
                                            "v8_1":  false,
                                            "v10_0":  false,
                                            "v10_1607":  true,
                                            "v10_1703":  false,
                                            "v10_1709":  false,
                                            "v10_1803":  false,
                                            "v10_1809":  false,
                                            "v10_1903":  false,
                                            "v10_1909":  false,
                                            "v10_2004":  false,
                                            "v10_2H20":  false,
                                            "v10_21H1":  false
                                        },
    "detectionRules":  [

                       ],
    "requirementRules":  [

                         ],
    "rules":  [
                  {
                      "@odata.type":  "#microsoft.graph.win32LobAppFileSystemRule",
                      "ruleType":  "detection",
                      "path":  "%ProgramFiles%\\Google\\Chrome\\Application",
                      "fileOrFolderName":  "chrome.exe",
                      "check32BitOn64System":  false,
                      "operationType":  "appVersion",
                      "operator":  "greaterThanOrEqual",
                      "comparisonValue":  "121.0.6167.185"
                  }
              ],
    "installExperience":  {
                              "runAsAccount":  "system",
                              "maxRunTimeInMinutes":  60,
                              "deviceRestartBehavior":  "basedOnReturnCode"
                          },
    "returnCodes":  [
                        {
                            "returnCode":  0,
                            "type":  "success"
                        },
                        {
                            "returnCode":  3010,
                            "type":  "softReboot"
                        },
                        {
                            "returnCode":  1618,
                            "type":  "retry"
                        },
                        {
                            "returnCode":  1707,
                            "type":  "success"
                        }
                    ],
    "msiInformation":  {
                           "productCode":  "{2973D1E7-DE82-3E05-9DBD-245F3B51E8A8}",
                           "productVersion":  "121.0.6167.185",
                           "upgradeCode":  "{C1DFDF69-5945-32F2-A35E-EE94C99C7CF4}",
                           "requiresReboot":  false,
                           "packageType":  "perMachine",
                           "productName":  "Google Chrome for Business",
                           "publisher":  "Google"
                       }
}
