{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type": "#microsoft.graph.winGetApp",
    "displayName": "Microsoft 365 (Office)",
    "description": "The Microsoft 365 app is home to all your favorite productivity apps and content. Now, with new ways to help you find, create, share and save your content, all in one place. Just sign in with your work, school, or personal Microsoft account to start using the free desktop app today. \r\n\r\nUse the Microsoft 365 app to:\r\n•   Focus on your tasks and quickly access documents shared with you or recently edited on the Home screen. \r\n•   Create beautiful content for any project or occasion using free templates across apps like Word, Excel, PowerPoint, Clipchamp, and more. \r\n•   Find your files and save them securely in OneDrive with 5 GB of free cloud storage with automatic content backups across your devices. \r\n•   Access your favorite Microsoft 365 apps in one place including Microsoft Teams, Word, Excel, PowerPoint, Outlook, OneDrive, OneNote, Visio, and so much more.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "isFeatured": false,
    "privacyInformationUrl": "http://go.microsoft.com/fwlink/?LinkID=521839",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "isAssigned": false,
    "roleScopeTagIds": [
        "0"
    ],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "manifestHash": null,
    "packageIdentifier": "9WZDNCRD29V9",
    "installExperience": {
        "runAsAccount": "user"
    }
}