{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type":  "#microsoft.graph.iosStoreApp",
    "id":  "ee62be9b-773c-4b1d-a931-14bb3056413c",
    "displayName":  "Microsoft Teams",
    "description":  "",
    "publisher":  "Microsoft Corporation",
    "isFeatured":  false,
    "privacyInformationUrl":  "",
    "informationUrl":  null,
    "owner":  "",
    "developer":  "",
    "notes":  "",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "bundleId":  "com.microsoft.skype.teams",
    "appStoreUrl":  "https://apps.apple.com/us/app/microsoft-teams/id1113153706?uo=4",
    "applicableDeviceType":  {
                                 "iPad":  true,
                                 "iPhoneAndIPod":  true
                             },
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  true,
                                            "v9_0":  false,
                                            "v10_0":  false,
                                            "v11_0":  false,
                                            "v12_0":  false,
                                            "v13_0":  false,
                                            "v14_0":  false,
                                            "v15_0":  false,
                                            "v16_0":  false,
                                            "v17_0":  false
                                        }
}
