{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type":  "#microsoft.graph.iosStoreApp",
    "id":  "b3d43059-7dfa-4988-94fd-b1bbbc5108ec",
    "displayName":  "Microsoft Teams",
    "description":  "Whether you�re connecting with your community for an upcoming activity or working with teammates on a project, Microsoft Teams helps bring people together so that they can get things done. It�s the only app that has communities, events, chats, channels, meetings, storage, tasks, and calendars in one place�so you can easily connect and manage access to information. Get your community, family, friends, or workmates together to accomplish tasks, share ideas, and make plans. Join audio and video calls in a secure setting, collaborate in documents, and store files and photos with built-in cloud storage. You can do it all in Microsoft Teams. \n\nEasily connect with anyone: \n� Meet securely with communities, teammates, family, or friends.\n� Set up a meeting within seconds and invite anyone by sharing a link or calendar invite. \n� Chat 1-1 or to your entire community, @mention people in chats to get their attention. \n� Create a dedicated community to discuss specific topics and make plans*.\n� Work closely and collaborate by keeping conversations organized by specific topics and projects with teams and channels.\n� Video or audio call anyone directly in Teams or instantly convert a group chat to a call. \n� Use GIFs, emojis, and message animations to express yourself when words aren�t enough.\n \nAccomplish plans and projects together: \n� Send photos and videos in chats to quickly and easily share important moments.\n� Use cloud storage to access shared documents and files on the go. \n� Organize shared content in a community � events, photos, links, files �so you don�t have to waste time searching*. \n� Get the most out of your meetings by using screen share, whiteboard, or breakout in virtual rooms.\n� Manage access to information and ensure the right people have access to the right info, even when people join and leave projects.\n� Use task lists to stay on top of projects and plans - assign tasks, set due dates, and cross off items to keep everyone on the same page. \n\nDesigned to give you peace of mind: \n� Securely collaborate with others while maintaining control over your data.\n� Keep communities safe by allowing owners to remove inappropriate content or members*.\n� Enterprise-level security and compliance you expect from Microsoft 365**. \n\n*Available when using Microsoft Teams with your Microsoft account.\n\n**Commercial features of this app require a paid Microsoft 365 commercial subscription or a trial subscription of Microsoft Teams for work. If you�re not sure about your company�s subscription or the services you have access to, visit Office.com/Teams to learn more or contact your IT department. \n\nBy downloading Teams, you agree to the license (see aka.ms/eulateamsmobile) and privacy terms (see aka.ms/privacy). For support or feedback, email us at mtiosapp@microsoft.com. EU Contract Summary: aka.ms/EUContractSummary",
    "publisher":  "Microsoft Corporation",
    "isFeatured":  false,
    "privacyInformationUrl":  "",
    "informationUrl":  null,
    "owner":  null,
    "developer":  null,
    "notes":  null,
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "bundleId":  "com.microsoft.skype.teams",
    "appStoreUrl":  "https://apps.apple.com/us/app/microsoft-teams/id1113153706?uo=4",
    "largeIcon":  null,
    "applicableDeviceType":  {
                                 "iPad":  true,
                                 "iPhoneAndIPod":  true
                             },
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  true,
                                            "v9_0":  false,
                                            "v10_0":  false,
                                            "v11_0":  false,
                                            "v12_0":  false,
                                            "v13_0":  false,
                                            "v14_0":  false,
                                            "v15_0":  false,
                                            "v16_0":  false,
                                            "v17_0":  false
                                        }
}
