{
  "Count": 12,
  "IsFixedSize": false,
  "IsReadOnly": false,
  "IsSynchronized": false,
  "Keys": [
    "templateReference",
    "settingCount",
    "id",
    "description",
    "roleScopeTagIds",
    "createdDateTime",
    "priorityMetaData",
    "platforms",
    "lastModifiedDateTime",
    "creationSource",
    "name",
    "technologies"
  ],
  "SyncRoot": {
    "templateReference": {
      "templateFamily": "baseline",
      "templateDisplayName": "Microsoft Defender for Endpoint Security Baseline"
    },
    "settingCount": 65,
    "description": "BP - Defender for Enpoint Security Baseline",
    "priorityMetaData": null,
    "platforms": "windows10",
    "name": "BP - Defender for Enpoint Security Baseline",
    "technologies": "mdm"
  },
  "Values": [
    {
      "templateFamily": "baseline",
      "templateDisplayName": "Microsoft Defender for Endpoint Security Baseline"
    },
    65,
    "b4f1ccd5-9798-414b-846a-ba440089aae7",
    "BP - Defender for Enpoint Security Baseline",
    "0",
    "2025-08-15T12:20:55.9310525Z",
    null,
    "windows10",
    "2025-08-15T12:20:55.9310525Z",
    null,
    "BP - Defender for Enpoint Security Baseline",
    "mdm"
  ],
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "simpleSettingCollectionValue": {
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "value": "{d48179be-ec20-11d1-b6b8-00c04fa372a7}"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": {
            "choiceSettingValue": {
              "children": null,
              "settingValueTemplateReference": {
                "useTemplateDefault": false
              },
              "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2"
            },
            "settingInstanceTemplateReference": {},
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
          },
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesenhancedpin_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": {
            "choiceSettingValue": {
              "children": null,
              "settingValueTemplateReference": {
                "useTemplateDefault": false
              },
              "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2"
            },
            "settingInstanceTemplateReference": {},
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
          },
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_2"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": {
                  "choiceSettingValue": {
                    "children": {
                      "choiceSettingValue": {
                        "children": null,
                        "settingValueTemplateReference": {
                          "useTemplateDefault": false
                        },
                        "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_2"
                      },
                      "settingInstanceTemplateReference": {},
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                    },
                    "settingValueTemplateReference": {
                      "useTemplateDefault": false
                    },
                    "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1"
                  },
                  "settingInstanceTemplateReference": {},
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                },
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": {
            "choiceSettingValue": {
              "children": null,
              "settingValueTemplateReference": {
                "useTemplateDefault": false
              },
              "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0"
            },
            "settingInstanceTemplateReference": {},
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
          },
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": {
            "choiceSettingValue": {
              "children": null,
              "settingValueTemplateReference": {
                "useTemplateDefault": false
              },
              "value": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_enablesmartscreendropdown_block"
            },
            "settingInstanceTemplateReference": {},
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
          },
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "user_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": {
            "choiceSettingValue": {
              "children": null,
              "settingValueTemplateReference": {
                "useTemplateDefault": false
              },
              "value": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter_ie9safetyfilteroptions_1"
            },
            "settingInstanceTemplateReference": {},
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
          },
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_2"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "groupSettingCollectionValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_audit"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands_audit"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail_block"
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": null
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 50
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_defender_configuration_oobeenablertpandsigupdate_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_puaprotection_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_scanparameter_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 120
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_schedulescanday_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 120
        }
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 4
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_3"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_global_crlcheck_0"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_true"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
        "choiceSettingCollectionValue": {
          "children": null,
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_enablepacketqueue_0"
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": [
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "children": null,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false
                },
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false"
              },
              "settingInstanceTemplateReference": {},
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ],
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 300
        }
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge~smartscreen_smartscreendnsrequestsenabled_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge~smartscreen_newsmartscreenlibraryenabled_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev78diff~policy~microsoft_edge~smartscreen_smartscreenfortrusteddownloadsenabled_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "children": null,
          "settingValueTemplateReference": {
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1"
        },
        "settingInstanceTemplateReference": {},
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      }
    }
  ]
}
