{
    "creationSource": null,
    "description": "",
    "name": "Security Baseline for Windows 10 and later",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 147,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "66df8dce-0166-4b82-92f7-1f74e3ca17a3_1",
        "templateFamily": "baseline",
        "templateDisplayName": "Security Baseline for Windows 10 and later",
        "templateDisplayVersion": "Version 23H2"
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7c7dc01b-fbad-4476-bbd9-97d6fdd6f557"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "85f42e96-fbc8-44f7-8cdf-83d645e215e0",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d4af93ed-8a54-4ce3-8468-e53486d58657"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "d26fde39-5e4d-4f2f-8c49-641033edbd60",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "a6c2cdd6-2c52-4548-b9c7-a1921fcf4717"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "443c4209-0973-41b3-bccb-bbbc3d5a81a3",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "4edbc00f-ea59-4c76-83db-be2f300d1c00"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "56202f91-eee8-4c14-b3e9-c4b7e72c28d8",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "5d3a1cbc-ce3e-4937-899b-81a7615b4982"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver_4",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7b3823db-9ce0-4c46-8282-da2de3396551",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "3582c437-7f7d-41da-be48-f6cc875d74dc"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "860c2e23-7eaa-4735-97fb-058eae5b8719",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "861c39fc-9eef-4070-982d-6c062a28ca11"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "3f96c091-58d3-456f-9e4b-9fd18e950f9e",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "96885e58-34ab-468d-8444-d0f91fbf10d0"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "bbe0fb65-31ca-4f87-9d2d-cdc95ade5b48",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d26001a0-5e2d-4f45-94f6-a8fb15b016d8"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "a2ff7ae1-ed74-4c1c-89a0-e22febeb44cd",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "087f2d64-b645-45ff-b820-8b071e321cde"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "f4e884b8-1fb3-4352-a72d-0866307b9dbe",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "3e5238aa-9ccc-45ed-8d94-a5a13c9ead63"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "a01e5ce1-378d-4a51-97ee-54568cb4b157",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "fc9ef55d-dd87-432e-9ab5-8cb709e3beee"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "3df42274-1de8-47a4-9943-bc94e0222758",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "e8b666cf-ae2f-48d8-bb52-0003244da18a"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "c621460a-7722-47da-9a92-3abb93fab0be",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ec6ff1d8-f6f0-4476-b2ba-a300402ca625"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "1a9b1e9b-b9ab-485a-b5dd-93377b1b5ee8",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "c2beaa88-fa59-4f55-99bf-a87e83d0e40e"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "dca2e64b-118f-48f5-af56-1e5f26e4e496",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "12",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "fd9e16e7-3362-4849-bdd9-347f0eb2f013"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "658d04ad-6c76-440d-b30c-0c3304f421ec",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "13",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "6bc0d23e-0338-45a7-a7a1-26c91052e3e0"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "579dd0e4-ad38-417d-9685-d7dd1b467811",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "c7a421c5-c3e1-4dfd-838b-4d13cd0a2a08"
                            },
                            "groupSettingCollectionValue": [
                                {
                                    "settingValueTemplateReference": null,
                                    "children": [
                                        {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                            "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                            "settingInstanceTemplateReference": {
                                                "settingInstanceTemplateId": "1b15b254-b280-4b38-b22e-fe3ca5af7c70"
                                            },
                                            "simpleSettingValue": {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                "value": "RequireMutualAuthentication=1,RequireIntegrity=1",
                                                "settingValueTemplateReference": {
                                                    "settingValueTemplateId": "aa4e239c-f452-4020-a01c-f705b5ba9a40",
                                                    "useTemplateDefault": false
                                                }
                                            }
                                        },
                                        {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                            "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                            "settingInstanceTemplateReference": {
                                                "settingInstanceTemplateId": "26f010c1-bc61-42af-9b97-e77fc4181512"
                                            },
                                            "simpleSettingValue": {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                "value": "\\\\*\\SYSVOL",
                                                "settingValueTemplateReference": {
                                                    "settingValueTemplateId": "931398fa-cf2a-4e3d-bf8c-36fda21a1925",
                                                    "useTemplateDefault": false
                                                }
                                            }
                                        }
                                    ]
                                },
                                {
                                    "settingValueTemplateReference": null,
                                    "children": [
                                        {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                            "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                            "settingInstanceTemplateReference": {
                                                "settingInstanceTemplateId": "2aa5902e-bc4f-4e98-9deb-582f226cd64c"
                                            },
                                            "simpleSettingValue": {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                "value": "RequireMutualAuthentication=1,RequireIntegrity=1",
                                                "settingValueTemplateReference": {
                                                    "settingValueTemplateId": "90233d64-60b6-4c8a-8c6c-555604f94b55",
                                                    "useTemplateDefault": false
                                                }
                                            }
                                        },
                                        {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                            "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                            "settingInstanceTemplateReference": {
                                                "settingInstanceTemplateId": "1cbb4781-392f-44d1-8660-eb05d5b18b0e"
                                            },
                                            "simpleSettingValue": {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                "value": "\\\\*\\NETLOGON",
                                                "settingValueTemplateReference": {
                                                    "settingValueTemplateId": "b1997627-00d3-46b0-9ac1-533b16cee206",
                                                    "useTemplateDefault": false
                                                }
                                            }
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            }
        },
        {
            "id": "14",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "787c60ff-a23f-4843-985f-5a537c0508cf"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "eef724ca-465a-43bf-9b7e-fa18e3ec128a",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "15",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "8203e137-23e9-4060-92e8-ecd45dd6e63e"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "84dcb49d-06e7-469a-9119-2b2d8c82d9f3",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "ec55a527-ce66-42eb-a449-9966e63b822f"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "a055ad15-a86a-4c10-91a3-bf4e5cf9aefe",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "16",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "83bda0a1-db1b-4fcb-ad7a-ab5b1635bb80"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "911bc668-aca7-40f8-920e-f70b35e052b2",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "f06e3c57-3493-4b72-ac34-71ac856eb52a"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "9b2bd846-f46b-4c88-941f-7e835e98ec97",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "6bb9775f-7b64-414d-93ad-d612270ef817"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "a64aba40-2334-4e0e-ba5e-c2568be53204",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "17",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "49a5e54e-685c-4c33-898d-d06db872bc67"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "7d8ffd7f-4abc-4e2d-9ae9-5f47103fda44",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "0c505b3a-b1f3-4963-948a-e45ec4e04ee7"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum_5",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "09bd0f47-8b2d-4518-8328-785345a22221",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "79479349-3107-47ac-942e-0153ee655a2e"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "394ffdbf-1a51-4e2e-988d-5b187344dbc4",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "18",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ae93831c-e0a2-4481-a5a0-35ac7ca5d582"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_configurerpctcpport_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "1cde5600-1862-41f4-90c5-d1f5b5bdbac3",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport_rpctcpport",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "c579c06a-37c2-41e8-989d-ee7645fbb4c8"
                            },
                            "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "value": 0,
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "51da7e44-cf39-4880-b3b2-8b40a4e4bb5e",
                                    "useTemplateDefault": false
                                }
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "19",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "66b2729a-5232-4bb3-9106-7cf17f29df14"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "843603d7-5624-45d4-8990-81da10cb97a6",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "20",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "333f196c-6067-46a0-84a8-e343f297ce24"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "8052e4ca-bb3e-42f3-aeff-bedccd112567",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "89cb9227-10a6-49b5-9fb6-b6c03996feac"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "e6b871f6-75c1-43ba-85f0-d3f25b68f3d1",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "21",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "8fa65f3d-a89a-4a03-a4e8-af26f55cd8bf"
                },
                "choiceSettingValue": {
                    "value": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "69133b32-d460-4f1e-a573-ca09aef142c9",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "22",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "952d951e-92af-4eda-9424-26c06308dda3"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "a4e0fbd3-202c-4874-9a8b-d4b56050ad99",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "d9e03c33-c6c1-4644-982f-41046fd4fc5d"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "66a96d0c-3a4f-4e25-b443-423c0aa42788",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "23",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "1159aa66-0335-4f49-b6ca-29a3453f0d64"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "63588f93-c0ec-4561-af47-f6437b12f843",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "24",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f4255e50-3ae1-4973-873a-2c7cf325a306"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "5df53c06-432c-4284-9596-59e1c6ddea2c",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_list",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "e1922cc8-c5ac-4c12-b03f-91c6269ac072"
                            },
                            "simpleSettingCollectionValue": [
                                {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "{d48179be-ec20-11d1-b6b8-00c04fa372a7}"
                                }
                            ]
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "949fd962-f769-4f76-93b0-bd1f5b01348d"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "025b4cb6-64e8-4347-91c8-58d0a7e483fe",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        }
    ]
}