{
  "creationSource": null,
  "technologies": "mdm",
  "templateReference": {
    "templateId": "66df8dce-0166-4b82-92f7-1f74e3ca17a3_4",
    "templateDisplayName": "Security Baseline for Windows 10 and later",
    "templateFamily": "baseline",
    "templateDisplayVersion": "Version 24H2"
  },
  "platforms": "windows10",
  "description": "Security Baseline for Windows v24H2",
  "name": "Security Baseline for Windows v24H2",
  "settingCount": 314,
  "roleScopeTagIds": [
    "0"
  ],
  "priorityMetaData": null,
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "85f42e96-fbc8-44f7-8cdf-83d645e215e0"
          },
          "value": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7c7dc01b-fbad-4476-bbd9-97d6fdd6f557"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "d26fde39-5e4d-4f2f-8c49-641033edbd60"
          },
          "value": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d4af93ed-8a54-4ce3-8468-e53486d58657"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "443c4209-0973-41b3-bccb-bbbc3d5a81a3"
          },
          "value": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a6c2cdd6-2c52-4548-b9c7-a1921fcf4717"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "56202f91-eee8-4c14-b3e9-c4b7e72c28d8"
          },
          "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7b3823db-9ce0-4c46-8282-da2de3396551"
                },
                "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver_4",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "5d3a1cbc-ce3e-4937-899b-81a7615b4982"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4edbc00f-ea59-4c76-83db-be2f300d1c00"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "860c2e23-7eaa-4735-97fb-058eae5b8719"
          },
          "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server_0",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3582c437-7f7d-41da-be48-f6cc875d74dc"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "3f96c091-58d3-456f-9e4b-9fd18e950f9e"
          },
          "value": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "861c39fc-9eef-4070-982d-6c062a28ca11"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection"
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "bbe0fb65-31ca-4f87-9d2d-cdc95ade5b48"
          },
          "value": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication_0",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "96885e58-34ab-468d-8444-d0f91fbf10d0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication"
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "a2ff7ae1-ed74-4c1c-89a0-e22febeb44cd"
          },
          "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f4e884b8-1fb3-4352-a72d-0866307b9dbe"
                },
                "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6_2",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "087f2d64-b645-45ff-b820-8b071e321cde"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d26001a0-5e2d-4f45-94f6-a8fb15b016d8"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel"
      },
      "id": "7"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "a01e5ce1-378d-4a51-97ee-54568cb4b157"
          },
          "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "3df42274-1de8-47a4-9943-bc94e0222758"
                },
                "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting_2",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "fc9ef55d-dd87-432e-9ab5-8cb709e3beee"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3e5238aa-9ccc-45ed-8d94-a5a13c9ead63"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel"
      },
      "id": "8"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "c621460a-7722-47da-9a92-3abb93fab0be"
          },
          "value": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes_0",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e8b666cf-ae2f-48d8-bb52-0003244da18a"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes"
      },
      "id": "9"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "1a9b1e9b-b9ab-485a-b5dd-93377b1b5ee8"
          },
          "value": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ec6ff1d8-f6f0-4476-b2ba-a300402ca625"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers"
      },
      "id": "10"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "dca2e64b-118f-48f5-af56-1e5f26e4e496"
          },
          "value": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c2beaa88-fa59-4f55-99bf-a87e83d0e40e"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast"
      },
      "id": "11"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "658d04ad-6c76-440d-b30c-0c3304f421ec"
          },
          "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fd9e16e7-3362-4849-bdd9-347f0eb2f013"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui"
      },
      "id": "12"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "579dd0e4-ad38-417d-9685-d7dd1b467811"
          },
          "value": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
              "groupSettingCollectionValue": [
                {
                  "children": [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "settingValueTemplateReference": {
                          "useTemplateDefault": false,
                          "settingValueTemplateId": "aa4e239c-f452-4020-a01c-f705b5ba9a40"
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "value": "RequireMutualAuthentication=1,RequireIntegrity=1"
                      },
                      "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "1b15b254-b280-4b38-b22e-fe3ca5af7c70"
                      },
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value"
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "settingValueTemplateReference": {
                          "useTemplateDefault": false,
                          "settingValueTemplateId": "931398fa-cf2a-4e3d-bf8c-36fda21a1925"
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "value": "\\\\*\\SYSVOL"
                      },
                      "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "26f010c1-bc61-42af-9b97-e77fc4181512"
                      },
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key"
                    }
                  ],
                  "settingValueTemplateReference": null
                },
                {
                  "children": [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "settingValueTemplateReference": {
                          "useTemplateDefault": false,
                          "settingValueTemplateId": "90233d64-60b6-4c8a-8c6c-555604f94b55"
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "value": "RequireMutualAuthentication=1,RequireIntegrity=1"
                      },
                      "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "2aa5902e-bc4f-4e98-9deb-582f226cd64c"
                      },
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value"
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "settingValueTemplateReference": {
                          "useTemplateDefault": false,
                          "settingValueTemplateId": "b1997627-00d3-46b0-9ac1-533b16cee206"
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "value": "\\\\*\\NETLOGON"
                      },
                      "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "1cbb4781-392f-44d1-8660-eb05d5b18b0e"
                      },
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key"
                    }
                  ],
                  "settingValueTemplateReference": null
                }
              ],
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "c7a421c5-c3e1-4dfd-838b-4d13cd0a2a08"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6bc0d23e-0338-45a7-a7a1-26c91052e3e0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths"
      },
      "id": "13"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "eef724ca-465a-43bf-9b7e-fa18e3ec128a"
          },
          "value": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "787c60ff-a23f-4843-985f-5a537c0508cf"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork"
      },
      "id": "14"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "84dcb49d-06e7-469a-9119-2b2d8c82d9f3"
          },
          "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "a055ad15-a86a-4c10-91a3-bf4e5cf9aefe"
                },
                "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum_1",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "ec55a527-ce66-42eb-a449-9966e63b822f"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8203e137-23e9-4060-92e8-ecd45dd6e63e"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy"
      },
      "id": "15"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "911bc668-aca7-40f8-920e-f70b35e052b2"
          },
          "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "9b2bd846-f46b-4c88-941f-7e835e98ec97"
                },
                "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum_0",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "f06e3c57-3493-4b72-ac34-71ac856eb52a"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum"
            },
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "a64aba40-2334-4e0e-ba5e-c2568be53204"
                },
                "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum_0",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "6bb9775f-7b64-414d-93ad-d612270ef817"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "83bda0a1-db1b-4fcb-ad7a-ab5b1635bb80"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy"
      },
      "id": "16"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7d8ffd7f-4abc-4e2d-9ae9-5f47103fda44"
          },
          "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "09bd0f47-8b2d-4518-8328-785345a22221"
                },
                "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum_5",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "0c505b3a-b1f3-4963-948a-e45ec4e04ee7"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum"
            },
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "394ffdbf-1a51-4e2e-988d-5b187344dbc4"
                },
                "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum_0",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "79479349-3107-47ac-942e-0153ee655a2e"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "49a5e54e-685c-4c33-898d-d06db872bc67"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy"
      },
      "id": "17"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "1cde5600-1862-41f4-90c5-d1f5b5bdbac3"
          },
          "value": "device_vendor_msft_policy_config_printers_configurerpctcpport_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "51da7e44-cf39-4880-b3b2-8b40a4e4bb5e"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "value": 0
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "c579c06a-37c2-41e8-989d-ee7645fbb4c8"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport_rpctcpport"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ae93831c-e0a2-4481-a5a0-35ac7ca5d582"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport"
      },
      "id": "18"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "843603d7-5624-45d4-8990-81da10cb97a6"
          },
          "value": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "66b2729a-5232-4bb3-9106-7cf17f29df14"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators"
      },
      "id": "19"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "8052e4ca-bb3e-42f3-aeff-bedccd112567"
          },
          "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "e6b871f6-75c1-43ba-85f0-d3f25b68f3d1"
                },
                "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum_1",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "89cb9227-10a6-49b5-9fb6-b6c03996feac"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "333f196c-6067-46a0-84a8-e343f297ce24"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy"
      },
      "id": "20"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "69133b32-d460-4f1e-a573-ca09aef142c9"
          },
          "value": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8fa65f3d-a89a-4a03-a4e8-af26f55cd8bf"
        },
        "settingDefinitionId": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification"
      },
      "id": "21"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "a4e0fbd3-202c-4874-9a8b-d4b56050ad99"
          },
          "value": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_1",
          "children": [
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "66a96d0c-3a4f-4e25-b443-423c0aa42788"
                },
                "value": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop_0",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "d9e03c33-c6c1-4644-982f-41046fd4fc5d"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "952d951e-92af-4eda-9424-26c06308dda3"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle"
      },
      "id": "22"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "63588f93-c0ec-4561-af47-f6437b12f843"
          },
          "value": "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials_1",
          "children": []
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1159aa66-0335-4f49-b6ca-29a3453f0d64"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials"
      },
      "id": "23"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "5df53c06-432c-4284-9596-59e1c6ddea2c"
          },
          "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "simpleSettingCollectionValue": [
                {
                  "settingValueTemplateReference": null,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "value": "{d48179be-ec20-11d1-b6b8-00c04fa372a7}"
                }
              ],
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "e1922cc8-c5ac-4c12-b03f-91c6269ac072"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_list"
            },
            {
              "choiceSettingValue": {
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "025b4cb6-64e8-4347-91c8-58d0a7e483fe"
                },
                "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive_1",
                "children": []
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "949fd962-f769-4f76-93b0-bd1f5b01348d"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive"
            }
          ]
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f4255e50-3ae1-4973-873a-2c7cf325a306"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses"
      },
      "id": "24"
    },
    {
      "id": "25",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_system_bootstartdriverinitialization",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_system_bootstartdriverinitialization_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_system_bootstartdriverinitialization_selectdriverloadpolicy",
              "settingInstanceTemplateReference": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_system_bootstartdriverinitialization_selectdriverloadpolicy_3",
                "children": []
              }
            }
          ]
        }
      }
    }
  ]
}